{
    "core": [
        {
            "name": "HTML & CSS",
            "description": "Form the foundation of my web development work, enabling me to create structured and visually appealing interfaces."
        },
        {
            "name": "JavaScript",
            "description": "The backbone of interactive and dynamic web applications I build."
        },
        {
            "name": "React",
            "description": "I use it to create scalable and reusable user interface components."
        },
        {
            "name": "TailwindCSS",
            "description": "Helps me rapidly style modern web interfaces with a utility-first approach."
        },
        {
            "name": "Figma",
            "description": "A vital tool for wireframing and prototyping design ideas collaboratively."
        }
    ],
    "learning": [
        {
            "name": "TypeScript",
            "description": "I'm learning it to add type safety and maintainability to JavaScript projects."
        },
        {
            "name": "Node.js",
            "description": "Currently exploring its potential for building efficient server-side applications."
        },
        {
            "name": "Express.js",
            "description": "I'm learning how to simplify backend development and API handling with it."
        },
        {
            "name": "MongoDB",
            "description": "Diving into its usage for creating flexible and scalable databases."
        },
        {
            "name": "Python",
            "description": "Studying its versatility for scripting and exploring automation opportunities."
        }
    ],
    "learnt": [
        {
            "name": "Bootstrap",
            "description": "Previously used it for rapid UI development but have since moved to other tools."
        },
        {
            "name": "Sass",
            "description": "Once a go-to for advanced CSS styling but now replaced by utility-first CSS frameworks."
        },
        {
            "name": "jQuery",
            "description": "Learned during early development projects but no longer a primary tool."
        }
    ]
}
